[
{"artistName": "Taylor Swift", 
"albumList": "The Tortured Poets Department, 1989 (Taylor's Version), Speak Now (Taylor's Version), Midnights, Red (Taylor's Versio), Fearless (Taylor's Version), evermore, folklore, Lover, reputation, 1989, Red, Speak Now, Fearless, Taylor Swift", 
"bio": "Taylor Alison Swift (born December 13, 1989) is an American singer-songwriter. A subject of widespread public interest with a vast fanbase, she has influenced the music industry, popular culture, and politics through her songwriting, artistry, entrepreneurship, and advocacy. - Wikipedia"},
{"artistName": "The Weeknd", 
"albumList": "Starboy, Dawn FM", 
"bio": "Abel Makkonen Tesfaye (born February 16, 1990), known professionally as the Weeknd, is a Canadian singer-songwriter. He is known for his unconventional music production, artistic reinventions, and signature use of the falsetto register. - Wikipedia"},
{"artistName": "Selena Gomez", 
"albumList": "Kiss & Tell, A Year Without Rain, When the Sun Goes Down, Stars Dance, Revival, Rare", 
"bio": "Selena Marie Gomez (born July 22, 1992) is an American singer, songwriter, actress, producer, and businesswoman. - Wikipedia"},
{"artistName": "Jonas Brothers", 
"albumList": "It's About Time, Jonas Brothers, A Little Bit Longer, Lines, Vines, and Trying Times, Happiness Begins, The  Album", 
"bio": "The Jonas Brothers are an American pop rock band. - Wikipedia"},
{"artistName": "IU", 
"albumList": "Growing Up, Last Fantasy, Modern Times, Palette, Lilac", 
"bio": "Lee Ji-eun (Korean: 이지은; born May 16, 1993), also known by her stage name IU (아이유), is a South Korean singer-songwriter and actress. - Wikipedia"},
{"artistName": "Olivia Rodrigo", 
"albumList": "Sour, Guts", "bio": "Olivia Isabel Rodrigo (born February 20, 2003) is an American singer-songwriter and actress. - Wikipedia"},
{"artistName": "Miley Cyrus", 
"albumList": "Meet Miley Cyrus, Breakout, Can't Be Tamed, Bangerz,  Miley Cyrus & Her Dead Petz, Younger Now, Plastic Hearts, Endless Summer Vacation", 
"bio": "Miley Ray Cyrus (born Destiny Hope Cyrus on November 23, 1992) is an American singer, songwriter, and actress. Regarded as a pop icon, she has been recognized for her evolving artistry and style, having been named as the Teen Queen of the 2000s. - Wikipedia"},
{"artistName": "Hilary Duff", 
"albumList": "Santa Claus Lane, Metamorphosis, Hilary Duff, Dignity, Breathe In.  Breathe Out.", 
"bio": "Hilary Erhard Duff (born September 28, 1987) is an American actress, singer, author and businesswoman - Wikipedia"},
{"artistName": "Owl City", 
"albumList": "Maybe I'm Dreaming, Ocean Eyes, All Things Bright & Beautiful, Th e Midsummer Station, Mobile Orchestra, Cinematic, Coco Moon", 
"bio": "Owl City is an American electronic music project created in 2007 in Owatonna, Minnesota. It is one of several projects by singer, songwriter and multi-instrumentalist Adam Young, who created the project while experimenting with music in his parents' basement. - Wikipedia"},
{"artistName": "Jesse McCartney", 
"albumList": "Beautiful Soul, Right Where You Want Me, Departure, Have It  All, In Technicolor, New Stage", 
"bio": "Jesse McCartney (born April 9, 1987) is an American actor and singer-songwriter. - Wikipedia"}
]